---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.AutoJoinFailedException
source: html/d5fe67a2-461b-f323-5ef6-5e8f61f51e25.htm
---
# AutoJoinFailedException Methods

Retrieves data needed to serialize the target object.